function [output] = T2Gas(T, far, option)
% T2GAS 气体热力性质计算
%   此处显示详细说明
% 气体热力性质公式系数，计算范围为200K-2000K
if (200 <= T) && (T < 800)
    a0 = 0.24336328; a1 = -0.32921648E-04; a2 = 0.4739514E-07; a3 = 0.10126855E-09; a4 = -0.89883655E-13;
    b0 = -0.085863702; b1 = 0.10787235E-02; b2 = 0.67154771E-06; b3 = -0.51850414E-08; b4 = 0.68521981E-11; b5 = -0.29202103E-14;
    c0 = 14.960690; c1 = -0.12635675; c2 = 0.76971033E-03; c3 = -0.51758509E-06; c4 = 0.59596120E-10; c5 = 0.83337678E-13;
    d0 = -2.4830304; d1 = -0.79956103E-03; d2 = 0.45828797E-04; d3 = -0.88952464E-07; d4 = 0.78009878E-10; d5 = -0.26503319E-13;
elseif (800 <= T) && (T <= 2000)
    a0 = 0.19075549; a1 = 0.12752498E-03; a2 = -0.54651988E-07; a3 = 0.89378182E-11; a4 = 0;
    b0 = 0.26004518; b1 = -0.33817793E-4; b2 = 0.45763254E-6; b3 = -0.29619121E-9; b4 = 0.73252744E-13; b5 = -0.62379644E-17;
    c0 = -42.237153; c1 = 0.19989167; c2 = 0.87121923E-04; c3 = 0.60082756E-07; c4 = -0.29954469E-10; c5 = 0.39185699E-14;
    d0 = -4.4056245; d1 = 0.15568789E-01; d2 = -0.99426593E-05; d3 = 0.57149417E-08; d4 = -0.18514490E-11; d5 = 0.24347693E-15;
end
% 根据数字选择求解性质，1比热（容），2总焓，3熵函数，4气体常数
if option == 1
    output = T2Cp(T, far, a0, a1, a2, a3, a4, b0, b1, b2, b3, b4, b5)*1000;
elseif option == 2
    output = T2H(T, far, a0, a1, a2, a3, a4, c0, c1, c2, c3, c4, c5)*1000;
elseif option == 3
    output = T2S(T, far, a0, a1, a2, a3, a4, d0, d1, d2, d3, d4, d5);
elseif option == 4
    R = 287.05 - 0.00990*far + 1e-7*far^2; % 赵运生论文公式
    output = R;
end

end

%% 单独气体热力性质公式函数定义
% 计算比热（容）
function [Cp] = T2Cp(T, far, a0, a1, a2, a3, a4, b0, b1, b2, b3, b4, b5)
Cpair = (a0 + a1*T + a2*T^2 + a3*T^3 + a4*T^4)*4.185;
KCp = (b0 + b1*T + b2*T^2 + b3*T^3 + b4*T^4 + b5*T^5)*4.185;
Cp = Cpair + far/(1 + far)*KCp;
end

% 计算焓
function [H] = T2H(T, far, a0, a1, a2, a3, a4, c0, c1, c2, c3, c4, c5)
if (200 <= T) && (T < 800)
    Hair = (-0.405671 + a0*T + a1/2*T^2 + a2/3*T^3 + a3/4*T^4 + a4/5*T^5)*4.185;
elseif (800 <= T) && (T <= 2000)
    Hair = (11.31763 + a0*T + a1/2*T^2 + a2/3*T^3 + a3/4*T^4 + a4/5*T^5)*4.185;
end
KH = (c0 + c1*T + c2*T^2 + c3*T^3 + c4*T^4 + c5*T^5)*4.185;
H = Hair + far/(1 + far)*KH;
end

% 计算熵函数
function [S] = T2S(T, far, a0, a1, a2, a3, a4, d0, d1, d2, d3, d4, d5)
if (200 <= T) && (T < 800)
    Sair=(0.2197072541 + a0*log(T) + a1*T + a2/2*T^2 + a3/3*T^3 + a4/4*T^4)*6.3352562;
elseif (800 <= T) && (T <= 2000)
    Sair=(0.4822215381 + a0*log(T) + a1*T + a2/2*T^2 + a3/3*T^3 + a4/4*T^4)*6.3352562;
end
KS = (d0 + d1*T + d2*T^2 + d3*T^3 + d4*T^4 + d5*T^5)*0.4342945;
S = Sair + far/(1 + far)*KS;
end